{
  "backend/main.mo": "Motoko backend providing user profile management and listing creation with access control and input validation.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to related frontend files and components.",
  "frontend-file-summaries.txt": "Reference document listing short summaries of all frontend files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML file bootstrapping the React app with main.tsx.",
  "frontend/src/App.tsx": "Main router setup defining all app routes and rendering layout, theme provider, and toaster.",
  "frontend/src/components/auth/AuthGate.tsx": "Route guard that shows a loading spinner or sign-in prompt when the user is not authenticated.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and query cache reset.",
  "frontend/src/components/auth/SignInPrompt.tsx": "Card prompting unauthenticated users to sign in with Internet Identity.",
  "frontend/src/components/feedback/ErrorAlert.tsx": "Reusable alert component displaying error messages using shadcn UI styling.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper providing header, footer, and profile setup modal around all pages.",
  "frontend/src/components/layout/Footer.tsx": "Footer with branding, attribution, and platform tagline.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation links, mobile menu, and user greeting based on authentication and profile state.",
  "frontend/src/components/listings/BrowseControls.tsx": "Search, category filter, and sort controls for browsing listings.",
  "frontend/src/components/listings/ListingCard.tsx": "Displays listing details with price, location, and optional edit/deactivate actions.",
  "frontend/src/components/listings/ListingForm.tsx": "Form for creating or editing listings with validation, error display, and submission handling.",
  "frontend/src/components/profile/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name.",
  "frontend/src/features/listings/listingsFiltering.ts": "Filters and sorts listings by search text, category, and sort option.",
  "frontend/src/features/listings/listingsQueries.ts": "React Query hooks for fetching, creating, updating, and deactivating listings using the backend actor.",
  "frontend/src/features/listings/listingValidation.ts": "Validates listing input fields with length and value constraints, returning errors.",
  "frontend/src/features/profile/profileQueries.ts": "React Query hooks to fetch and save the current user's profile via the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user's Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light and dark themes, plus base styling utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AboutHelpPage.tsx": "Shows an About section and FAQ accordion explaining Kisan Kart and providing user help.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Displays all active listings with search, category filters, sorting, and loading/error states.",
  "frontend/src/pages/CreateListingPage.tsx": "Authenticated page providing a form to create a new listing and redirecting on success.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero content, feature highlights, and calls to action for browsing or creating listings.",
  "frontend/src/pages/ListingDetailPage.tsx": "Displays detailed information for a single listing, handling loading/error states and showing description, metadata, and navigation back to browsing.",
  "frontend/src/pages/MyListingsPage.tsx": "Shows the authenticated user's listings with options to edit or deactivate them, including an edit dialog and loading/error handling.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins for the project.",
  "project_state.json": "Stores the project’s current metadata, features, requirements, and image needs for the Kisan Kart application."
}